% FIS-регулятор уровня воды в баке                        (LR_3_BakVoda.m)
%==========================================================================
clear all       % очистка памяти (leaving the workspace empty)
clc             % очистка командного окна  (Clear Command Window) 
%--------------------------------------------------------------------------

% Параметры модели
% Sb = 1.0;       % [m.kv] площадь полверхности жидкости
% Kz = 0.5;       % коэффициент усиления задвижки
% Ki = 0.05;      % коэффициент усиления обратной связи бака

% % Вариант 7

Sb = 7.0;   Kz = 2.2;    Ki = 2.1;  

%Sb = 7.0 * 1.2;   Kz = 2.2 * 1.2;    Ki = 2.1 * 1.2;

%Sb = 7.0 * 0.8;   Kz = 2.2 * 0.8;    Ki = 2.1 * 0.8;

%Sb = 7.0 * 1.6;   Kz = 2.2 * 1.6;    Ki = 2.1 * 1.6;

%Sb = 7.0 * 0.4;   Kz = 2.2 * 0.4;    Ki = 2.1 * 0.4;
   
%--------------------------------------------------------------------------
%  Синтез FIS-регулятор уровня воды в баке 
% (регулятор создается в среде GUI Fuzzy Logic Toolbox 
%  и сохраняется на диске под именем RgUrVd.fis)
% ---------------------------------------
%fuzzy
fisREG = readfis('RgUrVd_custom');
%fuzzy(fisREG)
% ---------------------------------------


%--------------------------------------------------------------------------
% Пример из MatLab

%open_system('sltankrule');
sim('sltankrule',100);
%bdclose('sltankrule');