%   Нечёткая аппроксимация зависимости: y=x1^2*sin(x2-1)
%                                                         (a2_IssledFIS.m)
%  <<< Исследование эффективности систем нечёткого вывода >>>
%==========================================================================

clc;
clear;
close all;  

%==========================================================================
% y=exp(-abs(x1))*(x1^5+x2^4)*sin(x1*x2)^2
% Построение графика функции  y(x1, x2)
% в области    x1 e [-1.5, 1.5];  x2 e [-2.2, 2.2]
%---------------------------------------------

n = 15;         % количество точек дискретизации
x1 = linspace(-1.5, 1.5, n);
x2 = linspace(-2.2, 2.2, n);

y = zeros(n, n);

for i = 1:n
    y(i,:) = exp(-abs(x1)).*(x1.^5+x2(i)^4).*sin(x1.*x2(i)).^2;   
end    

%---------------------------------------------
h1 = figure(1);
surf(x1, x2, y)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Исходная зависимость') 


%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Мамдани
% с треугольными функциями принадл. термов вх.перем.
%---------------------------------------------

fM = readfis('firstM');        % загрузка нечёткой системы с диска
% getfis(fM);
% showfis(fM);

yM = zeros(n, n);
for i = 1:n
    yM(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fM)';    
end  

%---------------------------------------------

h2 = figure(2);
set(h2,'Position',[5    65   524   407])
surf(x1, x2, yM)
% axis([-10     5 ...
%       -6	2 ...
%       -50   50]); 
% view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Мамдани (треуг.функ.прин.) - myfirstM.fis') 

%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Мамдани
% с гауссовыми функциями принадл. термов вх.перем.
%---------------------------------------------

fMg = readfis('firstMg');       % загрузка нечёткой системы с диска

yMg = zeros(n, n);
for i = 1:n
    yMg(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fMg)';    
end  

%---------------------------------------------

h3 = figure(3);
set(h3,'Position',[536    65   524   407])
surf(x1, x2, yMg)
axis([-1.5     1.5 ...
      -2.2	2.2 ...
      -2   12]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Мамдани (гаус.функ.прин.) - firstMg.fis') 

%--------------------------------------------------------------------------
% Построение графика нечёткого отображения Сугено
%---------------------------------------------

fS = readfis('firstS');       % загрузка нечёткой системы с диска

yS = zeros(n, n);
for i = 1:n
    yS(i,:) = evalfis([x1; ones(size(x1))*x2(i)], fS)';    
end  

%---------------------------------------------

h4 = figure(4);
set(h4,'Position',[1067  65  524  407])
surf(x1, x2, yS)
axis([-1.5     1.5 ...
      -2.2	2.2 ...
      -2   12]); 
view(-40,30)
xlabel('x_1');   ylabel('x_2');   zlabel('y');
title('Система нечёткого вывода Сугено - firstS.fis') 

%--------------------------------------------------------------------------
% Вычисление среднеквадратических значений ошибки нечёткой аппроксимации
%---------------------------------------------

% FIS Мамдани с треуг.функ.прин.терм.вх.перем.

eMkv = (y-yM).^2;               % квадрат ошибки аппрокс.в узловых точках
SeMkv = sum(sum(eMkv));         % сумма квадратов ошибок по всем точкам
NeM = numel(yM);                % общее количество контрольных точек
RMSE_M = sqrt(SeMkv/NeM);       % среднеквадратичное значение ошибки

% FIS Мамдани с гаус.функ.прин.терм.вх.перем.
RMSE_Mg = sqrt(sum(sum((y-yMg).^2))/numel(yMg));	% среднекв.знач.ошибки

% FIS Сугено
RMSE_S = sqrt(sum(sum((y-yS).^2))/numel(yS));       % среднекв.знач.ошибки

%---------------------------------------------

disp(' ')
disp('Средние квадратические значения ошибки аппроксимации:')
disp([' FIS Мамдани с треуг.функ.прин.терм.вх.перем.:  RMSE = ',  num2str(RMSE_M)])
disp([' FIS Мамдани с гаусс.функ.прин.терм.вх.перем.:  RMSE = ',  num2str(RMSE_Mg)])
disp([' FIS Сугено:                                    RMSE = ',  num2str(RMSE_S)])
disp(' ')

%---------------------------------------------
figure(2);
xlabel(['x_1       RMSE = ',num2str(RMSE_M)]);

figure(3);
xlabel(['x_1       RMSE = ',num2str(RMSE_Mg)]);

figure(4);
xlabel(['x_1       RMSE = ',num2str(RMSE_S)]);
%---------------------------------------------



